# リンク予測(drug_bank)
## ECFP -> ニューラルネットワーク

In [2]:
import pandas as pd
import numpy as np

In [3]:
# import xml.etree.ElementTree as ET
# tree = ET.parse('full_database.xml')

In [4]:
import csv

In [5]:
from rdkit import Chem
from rdkit.Chem import AllChem, Draw, PandasTools

In [6]:
# root = tree.getroot()
# root

In [7]:
# print(root.tag,root.attrib)

In [8]:
# child = root[1]
# for c in child:
#    print(c.tag,c.attrib)

In [9]:
# child.keys()

In [10]:
# child.get("updated")

In [11]:
# print(type(child))

In [12]:
# for i in child.iter():
#    print(i.tag, i.attrib, i.text)

In [13]:
"""
drugdic = {}
for child in root:
    tempname = child.findtext('{http://www.drugbank.ca}drugbank-id')
    drugdic[tempname] = []
    for grandson in child:
        for deepson in grandson:
            if deepson.findtext('{http://www.drugbank.ca}drugbank-id') is not None:
                tempintname = deepson.findtext('{http://www.drugbank.ca}drugbank-id')
                drugdic[tempname].append(tempintname)
"""

"\ndrugdic = {}\nfor child in root:\n    tempname = child.findtext('{http://www.drugbank.ca}drugbank-id')\n    drugdic[tempname] = []\n    for grandson in child:\n        for deepson in grandson:\n            if deepson.findtext('{http://www.drugbank.ca}drugbank-id') is not None:\n                tempintname = deepson.findtext('{http://www.drugbank.ca}drugbank-id')\n                drugdic[tempname].append(tempintname)\n"

In [14]:
"""
with open('data.csv', 'a', newline='') as f:
    writer = csv.writer(f)
    for i in drugdic:
        item = drugdic[i]
        x = [i]
        y = x + item
        if item == []:
            continue
        else:
            x = [i]
            y = x + item
            writer.writerow(y)
"""

"\nwith open('data.csv', 'a', newline='') as f:\n    writer = csv.writer(f)\n    for i in drugdic:\n        item = drugdic[i]\n        x = [i]\n        y = x + item\n        if item == []:\n            continue\n        else:\n            x = [i]\n            y = x + item\n            writer.writerow(y)\n"

In [15]:
def list_to_match(li):
    x = li[0]
    ans_li = []
    for i in li[1:]:
        y = [x,i]
        ans_li.append(y)
    return ans_li

In [16]:
"""
ans_li = []
with open('data.csv') as f:
    reader = csv.reader(f)
    for i in reader:
        ans_li += list_to_match(i)
"""

"\nans_li = []\nwith open('data.csv') as f:\n    reader = csv.reader(f)\n    for i in reader:\n        ans_li += list_to_match(i)\n"

In [17]:
from rdkit import Chem

In [18]:
# mols= Chem.SDMolSupplier('structures.sdf')

In [19]:
"""
mol = mols[0]
for key in mol.GetPropNames():
    print(key,mols[0].GetProp(key))
"""

'\nmol = mols[0]\nfor key in mol.GetPropNames():\n    print(key,mols[0].GetProp(key))\n'

In [20]:
# print(mols[106]==None)

In [21]:
"""
compounds_li = []
for i in mols:
    if i == None:
        continue
    else:
        name = i.GetProp("DATABASE_ID")
        smiles = i.GetProp("SMILES")
        x = [name, smiles]
        compounds_li.append(x)
"""

'\ncompounds_li = []\nfor i in mols:\n    if i == None:\n        continue\n    else:\n        name = i.GetProp("DATABASE_ID")\n        smiles = i.GetProp("SMILES")\n        x = [name, smiles]\n        compounds_li.append(x)\n'

In [22]:
# df1 = pd.DataFrame(compounds_li)

In [23]:
# df1.tail()

In [24]:
# df1.to_csv("compounds.csv")

In [25]:
def f1(smiles):
    mol = Chem.MolFromSmiles(smiles)
    bit_morgan = {}
    if mol == None:
        return [0] * 512
    else:
        fp = AllChem.GetMorganFingerprintAsBitVect(mol, radius=2, nBits=512, bitInfo=bit_morgan)
    return list(fp)

In [100]:
df1 = pd.read_csv("compounds.csv")
df1 = df1.drop('Unnamed: 0', axis=1)

In [101]:
df1.rename(columns={"0": 'compound'},inplace=True)
df1.rename(columns={"1": 'smiles'},inplace=True)

In [102]:
df1.head()

  compound                                             smiles
0  DB00006  CC[C@H](C)[C@H](NC(=O)[C@H](CCC(O)=O)NC(=O)[C@...
1  DB00007  CCNC(=O)[C@@H]1CCCN1C(=O)[C@H](CCCNC(N)=N)NC(=...
2  DB00014  CC(C)C[C@H](NC(=O)[C@@H](COC(C)(C)C)NC(=O)[C@H...
3  DB00027  CC(C)C[C@@H](NC(=O)CNC(=O)[C@@H](NC=O)C(C)C)C(...
4  DB00035  NC(=O)CC[C@@H]1NC(=O)[C@H](CC2=CC=CC=C2)NC(=O)...

In [103]:
df1["smiles"] = df1["smiles"].map(f1)

In [104]:
df1.head()

  compound                                             smiles
0  DB00006  [0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...
1  DB00007  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2  DB00014  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3  DB00027  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4  DB00035  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...

In [92]:
df = pd.read_csv("data_pare.csv")

In [93]:
df = df.drop('Unnamed: 0', axis=1)
df.head()

         0        1
0  DB00001  DB06605
1  DB00001  DB06695
2  DB00001  DB01254
3  DB00001  DB01609
4  DB00001  DB01586

In [94]:
df.rename(columns={"0": 'compound_1'},inplace=True)
df.rename(columns={"1": 'compound_2'},inplace=True)

In [95]:
df.head()

  compound_1 compound_2
0    DB00001    DB06605
1    DB00001    DB06695
2    DB00001    DB01254
3    DB00001    DB01609
4    DB00001    DB01586

In [35]:
df.rename(columns={"compound_1": 'compound'},inplace=True)
df2 = pd.merge(df, df1,on = "compound")

In [36]:
df2.rename(columns={"compound": 'compound_1'},inplace=True)
df2.rename(columns={"compound_2": 'compound'},inplace=True)
df2.rename(columns={"smiles": 'smiles_1'},inplace=True)

In [37]:
df2.tail()

        compound_1 compound                                           smiles_1
1683545    DB15685  DB12781  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
1683546    DB15685  DB14055  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
1683547    DB15685  DB13746  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
1683548    DB15685  DB00714  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
1683549    DB15685  DB00472  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...

In [38]:
df3 = pd.merge(df2, df1,on = "compound")

In [39]:
df3.tail()

,compound_1,compound,smiles_1,smiles
1126537,DB14513,DB09499,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126538,DB09139,DB14600,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126539,DB09277,DB00644,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126540,DB14485,DB09130,"[0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126541,DB14513,DB09047,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, ..."

In [40]:
df3.rename(columns={"compound": 'compound_2'},inplace=True)
df3.rename(columns={"smiles": 'smiles_2'},inplace=True)

In [41]:
df3.tail()

,compound_1,compound_2,smiles_1,smiles_2
1126537,DB14513,DB09499,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126538,DB09139,DB14600,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126539,DB09277,DB00644,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126540,DB14485,DB09130,"[0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1126541,DB14513,DB09047,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, ..."

In [42]:
approved = df1["compound"].values.tolist()

In [43]:
df4 = df3.drop('smiles_1', axis=1)
df4 = df4.drop('smiles_2', axis=1)
df4.tail()

        compound_1 compound_2
1126537    DB14513    DB09499
1126538    DB09139    DB14600
1126539    DB09277    DB00644
1126540    DB14485    DB09130
1126541    DB14513    DB09047

In [44]:
def f2(x):
    ans = x[2:]
    return ans

In [45]:
df4["compound_1"] = df4["compound_1"].map(f2)
df4["compound_2"] = df4["compound_2"].map(f2)

In [46]:
df4.tail()

        compound_1 compound_2
1126537      14513      09499
1126538      09139      14600
1126539      09277      00644
1126540      14485      09130
1126541      14513      09047

In [99]:
df1.head()

  compound                                             smiles
0  DB00001  [0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...
1  DB00001  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2  DB00001  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3  DB00001  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4  DB00001  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...

In [48]:
df_compound1 = df4["compound_1"].values.tolist()
df_compound2 = df4["compound_2"].values.tolist()

In [62]:
li_link_pare = []
for i in range(len(df_compound1)):
    a = int(df_compound1[i])
    b = int(df_compound2[i])
    if a <= b:
        c = [str(a).zfill(5),str(b).zfill(5)]
    else:
        c = [str(b).zfill(5),str(a).zfill(5)]
    li_link_pare.append(c)

In [50]:
df1["compound"] = df1["compound"].map(f2)

In [51]:
df1.head()

  compound                                             smiles
0    00006  [0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...
1    00007  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2    00014  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3    00027  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4    00035  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...

In [63]:
li_compound = df1["compound"].values.tolist()

In [64]:
import itertools

In [65]:
all_pare =  list(itertools.combinations(li_compound,2))

In [66]:
li_link_pare = [tuple(i) for i in li_link_pare]

In [67]:
len(all_pare)

3044278

In [59]:
from tqdm.notebook import tqdm

In [70]:
result = list(set(all_pare) - set(li_link_pare))

In [75]:
df5 = pd.DataFrame(result)

In [76]:
df5.head()

       0      1
0  01452  11570
1  00576  00863
2  00669  11326
3  00691  06710
4  00401  11134

In [77]:
def f3(x):
    ans = "DB"+ x
    return ans

In [81]:
df5.rename(columns={0: 'compound_1'},inplace=True)
df5.rename(columns={1: 'compound_2'},inplace=True)

In [82]:
df5.head()

  compound_1 compound_2
0      01452      11570
1      00576      00863
2      00669      11326
3      00691      06710
4      00401      11134

In [83]:
df5["compound_1"] = df5["compound_1"].map(f3)
df5["compound_2"] = df5["compound_2"].map(f3)

In [84]:
df5.tail()

        compound_1 compound_2
2481380    DB00271    DB01260
2481381    DB01336    DB11140
2481382    DB14018    DB14483
2481383    DB00825    DB06823
2481384    DB00419    DB00851

In [106]:
df5.rename(columns={"compound_1": 'compound'},inplace=True)
df6 = pd.merge(df5, df1,on = "compound")

In [108]:
df6.tail()

        compound compound_2                                             smiles
2481380  DB15465    DB15678  [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, ...
2481381  DB15465    DB15534  [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, ...
2481382  DB15465    DB15566  [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, ...
2481383  DB15465    DB15594  [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, ...
2481384  DB15679    DB15685  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ...

In [109]:
df6.rename(columns={"compound": 'compound_1'},inplace=True)
df6.rename(columns={"compound_2": 'compound'},inplace=True)
df6.rename(columns={"smiles": 'smiles_1'},inplace=True)

In [110]:
df7 = pd.merge(df6, df1,on = "compound")

In [111]:
df7.rename(columns={"compound": 'compound_2'},inplace=True)
df7.rename(columns={"smiles": 'smiles_2'},inplace=True)

In [112]:
df7.head()

,compound_1,compound_2,smiles_1,smiles_2
0,DB01452,DB11570,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ..."
1,DB00576,DB11570,"[0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ..."
2,DB00669,DB11570,"[0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ..."
3,DB00691,DB11570,"[1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ..."
4,DB00401,DB11570,"[1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ..."

In [113]:
df3.to_pickle("rink_pare.pkl")

In [114]:
df7.to_pickle("norink_pare.pkl")